NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_application.svd
        <register>
          <name>GRSTCTL</name>
          <description>Reset Register</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CSFTRST</name>
              <description>Mode: Host and Device. Core Soft Reset (CSftRst)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <description>No reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Resets hclk and phy_clock domains</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIUFSSFTRST</name>
              <description>Mode: Host and Device. PIU FS Dedicated Controller Soft Reset (PIUFSSftRst)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET_INACTIVE</name>
                  <description>No Reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_ACTIVE</name>
                  <description>PIU FS Dedicated Controller Soft Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMCNTRRST</name>
              <description>Mode: Host only. Host Frame Counter Reset (FrmCntrRst)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTACTIVE</name>
                  <description>No reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Host Frame Counter Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFFLSH</name>
              <description>Mode: Host and Device. RxFIFO Flush (RxFFlsh)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Does not flush the entire RxFIFO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Flushes the entire RxFIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFFLSH</name>
              <description>Mode: Host and Device. TxFIFO Flush (TxFFlsh)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Flush</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Selectively flushes a single or all transmit FIFOs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>Mode: Host and Device. TxFIFO Number (TxFNum)</description>
              <lsb>6</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXF0</name>
                  <description>-Periodic TxFIFO flush in host mode -Periodic TxFIFO 0 flush in device mode when in shared FIFO operation -TXFIFO 0 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF1</name>
                  <description>-Periodic TxFIFO flush in host mode -Periodic TxFIFO 1 flush in device mode when in shared FIFO operation -TXFIFO 1 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF2</name>
                  <description>-Periodic TxFIFO 2 flush in device mode when in shared FIFO operation -TXFIFO 2 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF3</name>
                  <description>-Periodic TxFIFO 3 flush in device mode when in shared FIFO operation -TXFIFO 3 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF4</name>
                  <description>-Periodic TxFIFO 4 flush in device mode when in shared FIFO operation -TXFIFO 4 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF5</name>
                  <description>-Periodic TxFIFO 5 flush in device mode when in shared FIFO operation -TXFIFO 5 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF6</name>
                  <description>-Periodic TxFIFO 6 flush in device mode when in shared FIFO operation -TXFIFO 6 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF7</name>
                  <description>-Periodic TxFIFO 7 flush in device mode when in shared FIFO operation -TXFIFO 7 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF8</name>
                  <description>-Periodic TxFIFO 8 flush in device mode when in shared FIFO operation -TXFIFO 8 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF9</name>
                  <description>-Periodic TxFIFO 9 flush in device mode when in shared FIFO operation -TXFIFO 9 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF10</name>
                  <description>-Periodic TxFIFO 10 flush in device mode when in shared FIFO operation -TXFIFO 10 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF11</name>
                  <description>-Periodic TxFIFO 11 flush in device mode when in shared FIFO operation -TXFIFO 11 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF12</name>
                  <description>-Periodic TxFIFO 12 flush in device mode when in shared FIFO operation -TXFIFO 12 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF13</name>
                  <description>-Periodic TxFIFO 13 flush in Device mode when in shared FIFO operation -TXFIFO 13 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF14</name>
                  <description>-Periodic TxFIFO 14 flush in Device mode when in shared FIFO operation -TXFIFO 14 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x0E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF15</name>
                  <description>-Periodic TxFIFO 15 flush in Device mode when in shared FIFO operation - TXFIFO 15 flush in device mode when in dedicated FIFO mode</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXF16</name>
                  <description>Flush all the transmit FIFOs in device or host mode</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKSWITCHTIMER</name>
              <description>This field is applicable if the controller is configured with multiple PHY interfaces.</description>
              <lsb>11</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TimerValue_19</name>
                  <description>timer value set to 19</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerValue_15</name>
                  <description>timer value set to 15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerValue_147</name>
                  <description>timer value set to 147</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerValue_50</name>
                  <description>timer value set to 50</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerValue_100</name>
                  <description>timer value set to 100</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerValue_125</name>
                  <description>timer value set to 125</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerValue_200</name>
                  <description>timer value set to 200</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TimerDisabled</name>
                  <description>timer is disabled</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSFTRSTDONE</name>
              <description>Mode: Host and Device. Core Soft Reset Done (CSftRstDone)</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No reset</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Core Soft Reset is done</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAREQ</name>
              <description>Mode: Host and Device. DMA Request Signal (DMAReq)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No DMA request</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>DMA request is in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBIDLE</name>
              <description>Mode: Host and Device. AHB Requester Idle (AHBIdle)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Not Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AHB Requester Idle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
