NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_application.svd
        <register>
          <name>CLEARPATTERN</name>
          <description>Clear the GPIO pattern array for antenna control</description>
          <addressOffset>0xD2C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLEARPATTERN</name>
              <description>Clear the GPIO pattern array for antenna control Behaves as a task register, but does not have PPI nor IRQ</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0xD30</addressOffset>
          <register>
            <dim>0x7</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DFEGPIO[%s]</name>
            <description>Description collection: Pin select for DFE pin n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DFEPACKET</name>
          <description>DFE packet EasyDMA channel</description>
          <headerStructName>RADIO_DFEPACKET</headerStructName>
          <access>read-write</access>
          <addressOffset>0xD50</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes to transfer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00004000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes to transfer</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTAMOUNT</name>
            <description>Number of bytes transferred in the current transaction</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the current transaction. Continuously updated.</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CRCSTATUS</name>
          <description>CRC status</description>
          <addressOffset>0xE0C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CRCSTATUS</name>
              <description>CRC status of packet received</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRCError</name>
                  <description>Packet received with CRC error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCOk</name>
                  <description>Packet received with CRC ok</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMATCH</name>
          <description>Received address</description>
          <addressOffset>0xE10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXMATCH</name>
              <description>Received address</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRC</name>
          <description>CRC field of previously received packet</description>
          <addressOffset>0xE14</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXCRC</name>
              <description>CRC field of previously received packet</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DAI</name>
          <description>Device address match index</description>
          <addressOffset>0xE18</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DAI</name>
              <description>Device address match index</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PDUSTAT</name>
          <description>Payload status</description>
          <addressOffset>0xE1C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PDUSTAT</name>
              <description>Status on payload length vs. PCNF1.MAXLEN</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LessThan</name>
                  <description>Payload less than PCNF1.MAXLEN</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GreaterThan</name>
                  <description>Payload greater than PCNF1.MAXLEN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CISTAT</name>
              <description>Status on what rate packet is received with in Long Range</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LR125kbit</name>
                  <description>Frame is received at 125 kbps</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LR500kbit</name>
                  <description>Frame is received at 500 kbps</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF0</name>
          <description>Packet configuration register 0</description>
          <addressOffset>0xE20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LFLEN</name>
              <description>Length on air of LENGTH field in number of bits.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>S0LEN</name>
              <description>Length on air of S0 field in number of bytes.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>S1LEN</name>
              <description>Length on air of S1 field in number of bits.</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>S1INCL</name>
              <description>Include or exclude S1 field in RAM</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Include S1 field in RAM only if S1LEN &amp;gt; 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>Always include S1 field in RAM independent of S1LEN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CILEN</name>
              <description>Length of code indicator - long range</description>
              <lsb>22</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>PLEN</name>
              <description>Length of preamble on air. Decision point: TASKS_START task</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8bit</name>
                  <description>8-bit preamble</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16bit</name>
                  <description>16-bit preamble</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32bitZero</name>
                  <description>32-bit zero preamble - used for IEEE 802.15.4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LongRange</name>
                  <description>Preamble - used for BLE long range</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCINC</name>
              <description>Indicates if LENGTH field contains CRC or not</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exclude</name>
                  <description>LENGTH does not contain CRC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>LENGTH includes CRC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TERMLEN</name>
              <description>Length of TERM field in Long Range operation</description>
              <lsb>29</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF1</name>
          <description>Packet configuration register 1</description>
          <addressOffset>0xE28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAXLEN</name>
              <description>Maximum length of packet payload. If the packet payload is larger than MAXLEN, the radio will truncate the payload to MAXLEN.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STATLEN</name>
              <description>Static length in number of bytes</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BALEN</name>
              <description>Base address length in number of bytes</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>ENDIAN</name>
              <description>On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Little</name>
                  <description>Least significant bit on air first</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Big</name>
                  <description>Most significant bit on air first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEEN</name>
              <description>Enable or disable packet whitening</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEOFFSET</name>
              <description>If whitening is enabled S0 can be configured to be excluded from whitening</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Include</name>
                  <description>S0 included in whitening</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Exclude</name>
                  <description>S0 excluded from whitening</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE0</name>
          <description>Base address 0</description>
          <addressOffset>0xE2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BASE0</name>
              <description>Base address 0</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE1</name>
          <description>Base address 1</description>
          <addressOffset>0xE30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BASE1</name>
              <description>Base address 1</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFIX0</name>
          <description>Prefixes bytes for logical addresses 0-3</description>
          <addressOffset>0xE34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AP0</name>
              <description>Address prefix 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AP1</name>
              <description>Address prefix 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>AP2</name>
              <description>Address prefix 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AP3</name>
              <description>Address prefix 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFIX1</name>
          <description>Prefixes bytes for logical addresses 4-7</description>
          <addressOffset>0xE38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AP4</name>
              <description>Address prefix 4</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AP5</name>
              <description>Address prefix 5</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>AP6</name>
              <description>Address prefix 6</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AP7</name>
              <description>Address prefix 7</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXADDRESS</name>
          <description>Transmit address select</description>
          <addressOffset>0xE3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXADDRESS</name>
              <description>Transmit address select</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
