NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_CLOCK_NS">
      <name>GLOBAL_CLOCK_S</name>
      <description>Clock management 1</description>
      <baseAddress>0x5010E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>CLOCK_POWER</name>
        <value>270</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_POWER_NS">
      <name>GLOBAL_POWER_S</name>
      <description>Power control 1</description>
      <baseAddress>0x5010E000</baseAddress>
      <alternatePeripheral>GLOBAL_CLOCK_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>CLOCK_POWER</name>
        <value>270</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_RESET_NS">
      <name>GLOBAL_RESET_S</name>
      <description>Reset control 1</description>
      <baseAddress>0x5010E000</baseAddress>
      <alternatePeripheral>GLOBAL_CLOCK_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_GLITCHDET_S</name>
      <description>Voltage glitch detectors</description>
      <baseAddress>0x50111000</baseAddress>
      <headerStructName>GLITCHDET</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GLITCHDET</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>Configuration for glitch detector</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable glitch detector</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable glitch detector</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable glitch detector</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Glitch detector mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HighPassFilter</name>
                  <description>High pass filter mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CapDiv</name>
                  <description>Cap divider mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_OSCILLATORS_NS</name>
      <description>Oscillator control 0</description>
      <baseAddress>0x40120000</baseAddress>
      <headerStructName>OSCILLATORS</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>OSCILLATORS</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>PLL</name>
          <description>Oscillator control</description>
          <headerStructName>OSCILLATORS_PLL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x800</addressOffset>
          <register>
            <name>FREQ</name>
            <description>Set speed of MCU power domain, including CPU.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FREQ</name>
                <description>Select CPU speed</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CK256M</name>
                    <description>256 MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK192M</name>
                    <description>192 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK128M</name>
                    <description>128 MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK96M</name>
                    <description>96 MHz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK64M</name>
                    <description>64 MHz</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTFREQ</name>
            <description>Current speed of MCU power domain, including CPU</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000004</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CURRENTFREQ</name>
                <description>Select CPU speed</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CK256M</name>
                    <description>256 MHz</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK192M</name>
                    <description>192 MHz</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK128M</name>
                    <description>128 MHz</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK96M</name>
                    <description>96 MHz</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CK64M</name>
                    <description>64 MHz</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
